Catalogs/ПравоваяБаза.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>ПравоваяБаза</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Должности</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ФайлыВБазе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ФайлыВБазе</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Файл</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Хеш</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВопросыПользователям</v8:Type>
						<v8:Type>cfg:CatalogRef.УчебныеЗанятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ПравоваяБаза/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура Добавить(Команда)
	
	ИмяФайла = "";
	Если ПоместитьФайл(АдресВХранилище, , ИмяФайла, , УникальныйИдентификатор) Тогда
		Файл = Новый Файл(ИмяФайла);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаписатьФайлВРегистр(ТекущийОбъект.Ссылка, АдресВХранилище, НомерВерсии);

КонецПроцедуры

&НаСервере
Функция ЗаписатьФайлВРегистр(Объект, АдресВХранилище, НомерВерсии)
	
	НаборЗаписей = РегистрыСведений.ФайлыВБазе.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Объект.Установить(Объект);
	НаборЗаписей.Отбор.НомерВерсии.Установить(НомерВерсии);
	
	Запись = НаборЗаписей.Добавить();
	Запись.Объект = Объект;
	Запись.НомерВерсии = НомерВерсии;
	
	Если ЭтоАдресВременногоХранилища(АдресВХранилище) Тогда
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВХранилище);
		Запись.Файл = Новый ХранилищеЗначения(ДвоичныеДанные);
	Иначе
		Запись.Файл = Неопределено;
	КонецЕсли;
	
	НаборЗаписей.Записать();
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Структура = ПолучитьАдресНомерФайла(Объект.Ссылка, УникальныйИдентификатор);
		АдресВХранилище = Структура.АдресВХранилище;
		НомерВерсии = Структура.НомерВерсии;
	Иначе
		НомерВерсии = 1;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресНомерФайла(Объект, ИдентификаторФормы)
	
	Структура = Новый Структура;
	Структура.Вставить("НомерВерсии", Неопределено);
	Структура.Вставить("АдресВХранилище", Неопределено);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Объект", Объект);
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ФайлыВБазе.Объект,
	|	ФайлыВБазе.НомерВерсии КАК НомерВерсии,
	|	ФайлыВБазе.Файл
	|ИЗ
	|	РегистрСведений.ФайлыВБазе КАК ФайлыВБазе
	|ГДЕ
	|	ФайлыВБазе.Объект = &Объект
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерВерсии УБЫВ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Выборка.Следующий();
	Структура.Вставить("НомерВерсии", Выборка.НомерВерсии);
	Структура.Вставить("АдресВХранилище", ПоместитьВоВременноеХранилище(Выборка.Файл.Получить(), ИдентификаторФормы));
	Выборка.Сбросить();
	
	Возврат Структура;
	
КонецФункции
